#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.datarepo-alerts.data.vault_generic_secret.slack_token will be read during apply
  # (config refers to values not yet known)
 <= data "vault_generic_secret" "slack_token"  {
      + data             = (sensitive value)
      + data_json        = (sensitive value)
      + id               = (known after apply)
      + lease_duration   = (known after apply)
      + lease_id         = (known after apply)
      + lease_renewable  = (known after apply)
      + lease_start_time = (known after apply)
      + path             = "secret/suitable/terraform/stackdriver/slack-token"
    }

  # module.datarepo-alerts.google_monitoring_notification_channel.notification_channel[0] will be updated in-place
  ~ resource "google_monitoring_notification_channel" "notification_channel" {
        display_name = "perf"
        enabled      = true
        id           = "projects/broad-jade-perf/notificationChannels/3869773518729165502"
      ~ labels       = {
          - "auth_token"   = "xoxb-12729891575-1301495169890-SUYNuZWXKWTdFGkT4W07MfGg"
          - "channel_name" = "#jade-alerts"
        } -> (known after apply)
        name         = "projects/broad-jade-perf/notificationChannels/3869773518729165502"
        project      = "broad-jade-perf"
        type         = "slack"
        user_labels  = {}
    }

  # module.datarepo-app.module.cloudsql.google_sql_database_instance.cloudsql_instance[0] will be updated in-place
  ~ resource "google_sql_database_instance" "cloudsql_instance" {
        connection_name               = "broad-jade-perf:us-central1:datarepo-db-jade-9d8cd7b3c9d45365"
        database_version              = "POSTGRES_11"
        first_ip_address              = "10.23.0.2"
        id                            = "datarepo-db-jade-9d8cd7b3c9d45365"
        ip_address                    = [
            {
                ip_address     = "10.23.0.2"
                time_to_retire = ""
                type           = "PRIVATE"
            },
        ]
        name                          = "datarepo-db-jade-9d8cd7b3c9d45365"
        private_ip_address            = "10.23.0.2"
        project                       = "broad-jade-perf"
        region                        = "us-central1"
        self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/broad-jade-perf/instances/datarepo-db-jade-9d8cd7b3c9d45365"
        server_ca_cert                = [
            {
                cert             = <<~EOT
                    -----BEGIN CERTIFICATE-----
                    MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQzOGZj
                    YTYyNy0wNzkwLTQzZDYtYjM1ZC01OTNiNGMwMjJjNTQxIzAhBgNVBAMTGkdvb2ds
                    ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
                    A1UEBhMCVVMwHhcNMjAwNjI2MTcyNjUyWhcNMzAwNjI0MTcyNzUyWjB3MS0wKwYD
                    VQQuEyQzOGZjYTYyNy0wNzkwLTQzZDYtYjM1ZC01OTNiNGMwMjJjNTQxIzAhBgNV
                    BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
                    IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
                    AQCX8MjR1dJxW9HhyKNdXwuymuA7XzXHzkbFd5j8s4zazYjGCgiwC+ebbEpDR3KR
                    /9cmAhbeSA7Ro9LHilnaGJis0cU0ExLie82an7dzwYP/nDKZtD9LD8B3hhtraXSy
                    KeUA4i1Jqr9r5QcA2aiDk7pqcag6WriDJ2VhB73ZrXBLa6/A1nvBhYdpilxxqzd0
                    jWOOC0t6xiKjmFumhKdUppJnrtxSSZZj09ks4Ai1VV3G8iJJg7e0VEpQIFbD2Z96
                    xTDlbrUBRbCrRfN6dmM3prP90rFalVzpzPFHX2G9Ke5zDoHX8QmMl9VZWgcUg74+
                    38dbQcb28j69UbprotM/+sy1AgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
                    DQYJKoZIhvcNAQELBQADggEBAAgt+qG7N3gZi19gp/rUWzA2DSpa3LUIOrgzFx5v
                    r051IoBHuh2mbDHdtj80vYHRegR6D2c+49XUSE/oLFxsZGCM0bgBpnVvJZOlIJos
                    gzJBGRg7F3RYFpGAfBRNYeZzBzqC6EReuQne6kAgEt87s9vtAXf4srcMO58T9bN2
                    eWzbQUtDQN9a4yjCBGhq+u2BI5tqo0PtRV32mADa5KEFDT+t5x1KXkLs+NJA19u2
                    1jvxEP80kc+42BhITWebwdImXVVzYgqsQQf+O3osRooogCEtmaEGVHGgHebzsW3q
                    79nAWA4uUyiBaRALrvzLNX0rGYs2g+ETAgcFc+urdGKMGXM=
                    -----END CERTIFICATE-----
                EOT
                common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=38fca627-0790-43d6-b35d-593b4c022c54"
                create_time      = "2020-06-26T17:26:52.496Z"
                expiration_time  = "2030-06-24T17:27:52.496Z"
                sha1_fingerprint = "eefe2b7775a7eb166370574ddffa4b1819cb40d1"
            },
        ]
        service_account_email_address = "p316927583106-khzw1o@gcp-sa-cloud-sql.iam.gserviceaccount.com"

      ~ settings {
            activation_policy           = "ALWAYS"
            authorized_gae_applications = []
            availability_type           = "REGIONAL"
            crash_safe_replication      = false
            disk_autoresize             = true
            disk_size                   = 10
            disk_type                   = "PD_SSD"
            pricing_plan                = "PER_USE"
            replication_type            = "SYNCHRONOUS"
          ~ tier                        = "db-g1-small" -> "db-n1-standard-2"
            user_labels                 = {
                "app" = "datarepo"
                "env" = "jade"
            }
            version                     = 16

            backup_configuration {
                binary_log_enabled = false
                enabled            = true
                start_time         = "06:00"
            }

            ip_configuration {
                ipv4_enabled    = false
                private_network = "projects/broad-jade-perf/global/networks/perf-network"
                require_ssl     = true
            }

            location_preference {
                zone = "us-central1-a"
            }
        }
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `environments/perf`*
